      *Skeleton COBOL Copybook
       01  fs-arqsaida.
           05  fs-arqsaida-1   PIC  X(001).
           05  fs-arqsaida-2   pic  x(001).
           05  fs-arqsaida-r   redefines fs-arqcliente-2  pic 99
           comp-x.
